fluid/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2012                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   uniform 0.0001882;

boundaryField
{
    airfoilDown
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           uniform 0.0001882;
    }
    airfoilUp
    {
        Ceps2           1.9;
        Ck              -0.416;
        Bk              8.366;
        C               11;
        type            kLowReWallFunction;
        value           uniform 0.0001882;
    }
    farfield
    {
        type            inletOutlet;
        inletValue      uniform 0.0001882;
        value           uniform 0.0001882;
    }
    BaseAndTop
    {
        type            empty;
    }
}


// ************************************************************************* //
